Autodesk.Navisworks.Api.Plugins.RenderPlugin.OverlayRenderModel(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.Graphics)
Override to allow custom drawing overlayed on main render.  Generally suitable for 3D rendering.

Autodesk.Navisworks.Api.Plugins.RenderPlugin.OverlayRenderWindow(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.Graphics)
Override to allow custom drawing overlayed on main render. Generally suitable for 2D rendering.

Autodesk.Navisworks.Api.Plugins.RenderPlugin.RenderModel(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.Graphics)
Override to allow custom drawing in main render. Generally suitable for 3D rendering.

Autodesk.Navisworks.Api.Plugins.RenderPlugin.RenderWindow(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.Graphics)
Override to allow custom drawing in main render. Starts in window context. Generally suitable for 2D rendering.